{
  "pishi": "2026-01-02T02:23:44.968493",
  "potty": "2026-01-02T02:23:44.968493",
  "It’s Okay to Accomplish Less: It is fine to prioritize investments into things you love, like family, even if it means you cannot pursue your passions as much or accomplish as much as others who have fewer commitments": "2026-01-02T02:23:44.968493",
  "A central lesson is understanding the misleading nature of public success and how it impacts your internal motivation:\nAvoid Drawing the Wrong Conclusion: Observing someone's impressive technical achievements (like PewDiePie customizing Arch Linux or building a high-end self-hosting AI rig) can lead to anxiety, impostor syndrome, or an existential crisis if you draw the wrong conclusion": "2026-01-02T02:23:44.968493",
  "• Focus on the Long Horizon: Getting better at something is not a 3-month competition; a developer's career is built over a 25-year-long horizon or a lifetime. You can still learn and pursue things even with much less time available": "2026-01-02T02:23:44.968493",
  "Cheer for Success: The correct mentality is to cheer for others when they succeed, which encourages you to try harder in the things that genuinely interest you, rather than feeling discouraged about where you currently are": "2026-01-02T02:23:44.968493",
  "Align Curiosity and Discipline: The ability to align curiosity and discipline is more crucial to achieving your goals than worrying about someone else having more free time than you": "2026-01-02T02:23:44.968493",
  "Accept Differences: It is okay if others learn faster or know more about specific topics, especially if those topics do not genuinely interest you. It is also fine to be a 9-to-5 worker who pursues unrelated hobbies like ultimate frisbee or playing guitar. You must not look at someone else and feel bad because you haven't achieved what they have, regardless of their material, time status, or ability": "2026-01-02T02:23:44.968493",
  "Dunya\nI tend to test ppl\nCuz I fear no one likes me\nI push ppl — just to see if they’ll push back": "2026-01-02T02:23:44.968493",
  "Don't feel bejati from what people say.\nDon't let their bad qualities that they project effect my day or week or life.\nUnderstand and try to help them.\nShaytan is over them.": "2026-01-02T02:23:44.968493",
  "last_sent_type": "knowing_allah"
}