{
  "If I consume haram\nThat limits the Quran entering into my heart": "2025-11-04T07:40:51.245872",
  "Priority is everything\nAllah is number ONE\nEverything below that — no matter how good it feels, how bad I want it.": "2025-11-04T07:40:51.245872",
  "Being tested is an honour\nAllah only tests the ones He loves": "2025-11-04T07:40:51.245872",
  "SAW: — say when new place come to\nWhen anyone lands at a place\nand says:\n“I seek refuge in the Perfect Word of Allah from the evil of what He has created.\"\n/\nA‘ūdhu bikalimātillāhi-t-tāmmāti min sharri mā khalaq\nNothing would harm him until he marches from that stopping place": "2025-11-04T07:40:51.245872",
  "Life isn’t designed to be comfortable, happy and easy.\nBy the creator’s design — it is uncomfortable, sad and full of struggles.": "2025-11-04T07:40:51.245872",
  "Knowing Allah, your Rab is the key to everything(know all names with meanings of Him) - Key to Khushu in namaz\n21 Al-Baasit         The Extender\n22 Al-Khaafidh       The Reducer, The Abaser\n23 Ar-Raafi’         The Exalter, The Elevator\n24 Al-Mu’izz         The Honourer, The Bestower\n25 Al-Muzil          The Dishonourer, The Humiliator\n26 As-Samee’         The All-Hearing\n27 Al-Baseer         The All-Seeing\n28 Al-Hakam          The Judge, The Giver of Justice\n29 Al-‘Adl           The Utterly Just\n30 Al-Lateef         The Subtle One, The Most Gentle": "2025-11-04T07:40:51.245872",
  "Reach a point where I only worry about my Rab and my deen.": "2025-11-04T07:40:51.245872",
  "SAW:\nWhoever prays Fajr in congregation,\nthen sits remembering Allah until the sun rises,\nthen prays two rak‘ahs,\nWill have a reward like that of Hajj and Umrah.\nComplete, complete, complete.": "2025-11-04T07:40:51.245872",
  "Hippie arab:\nThere are needs and wants\nMost of what we live are wants\nPrayer is what our soul need\nThat peace from the deen is what I personally need": "2025-11-04T07:40:51.245872",
  "Jihad un nafs — struggling with myself(my conscience) for the sake of Allah": "2025-11-04T07:40:51.245872",
  "Imam Shafi:\nMy heart is at ease knowing:\nWhat was meant for me will never miss me\nAnd that which misses me — was never meant for me": "2025-11-04T07:45:34.232435",
  "To get anger to leave\nAudhu billahi min ash-shaytan ir rajim\nI seek refuge in Allah from Shaytan, the rejected/cursed": "2025-11-04T07:45:34.232435",
  "SAW:\nWhen he made some profit in his business\nHe’d invest it back into bidness straight away": "2025-11-04T07:45:34.232435",
  "Be silent when angry.\nRandom quote but based on Hadith": "2025-11-04T07:45:34.232435",
  "SAW:\n\"The one who looks after a widow and a poor person\nis like the Mujahid in the cause of Allah,\nor\nlike the one who fasts all the day and stands (in prayer) all the night.”": "2025-11-04T07:45:34.232435",
  "SAW:\nZina and chori if in neighbourhood weighs 10x more than when with aam log.": "2025-11-04T07:45:34.232435",
  "Deeds most loved by Allah — those that are continuous, even if they are few.\nconsistency >>> quantity": "2025-11-04T07:45:34.232435",
  "SAW:\n\"I and the one who looks after an orphan will be like this in Paradise,\"\nshowing his middle and index fingers and separating them.": "2025-11-04T07:45:34.232435",
  "Knowing Allah, your Rab is the key to everything(know all names with meanings of Him) - Key to Khushu in namaz\n91 Ad-Dhaarr         The Distresser\n92 An-Naafi’         The Propitious, The Benefactor\n93 An-Noor           The Light\n94 Al-Haadi          The Guide\n95 Al-Badee’         The Incomparable Originator\n96 Al-Baaqi          The Ever-Lasting\n97 Al-Waarith        The Inheritor\n98 Ar-Rasheed        The Guide to the Right Path\n99 Al-Saboor         The Patient": "2025-11-04T07:45:34.232435",
  "Allah says\n“If you avoid the major sins which you are forbidden.\nWe will remove from your lesser sins and admit you to a noble entrance into paradise”\nMajor Sins:\n11 - Committing sodomy – Homosexual acts are forbidden in Islam.\n12 - Taking or paying interest (Riba) – Usury is strictly prohibited and leads to destruction.\n13 - Devouring orphan’s wealth – Wrongfully consuming orphan’s wealth is like eating fire.\n14 - Lying about Allah and His Messenger – Fabricating lies about religion leads to punishment.\n15 - Fleeing from the battlefield – Running away from battle without valid reason is sinful.\n16 - Being an unjust ruler – Oppression by leaders results in severe consequences.\n17 - Pride and arrogance – Arrogance leads to downfall and rejection from Paradise.\n18 - Ungratefulness – Not recognizing Allah’s blessings is condemned.\n19 - Intoxicants (alcohol and drugs) – Consuming intoxicants is the work of Satan.\n20 - Gambling – Wasting wealth through betting is a sinful act.": "2025-11-04T07:45:34.232435",
  "Never judge anyone for their current\nAllah chose Umar RA when he was the lead in torturing Muslims.\nJudge people by their last moments\nEveryone has reasons why their judgement is clouded — it isn't their time yet.\nShaytan still has a hold.": "2025-11-04T07:53:32.238183",
  "Maintain ties to kinship\nSevering is a major sin\nParents — daily basis\nSIblings — every week — 20 to 30 secs\nAunts/uncles — once a month maybe\n2nd czuns — call once every couple of months": "2025-11-04T07:53:32.238183",
  "Whenever SAW given choice of one of two matters\nHe would choose the easier of the two,\nas long as it was not sinful to do so\nbut if it was sinful to do so, he would not approach it.": "2025-11-04T07:53:32.238183",
  "This is a religion of knowledge.\nThe more I know, the stronger my iman.": "2025-11-04T07:53:32.238183",
  "Hadith:\n\"Whoever attends Isha in jamaat\nThen he has (the reward as if he had) stood half of the night.\nAnd whoever prays Isha and Fajr in jamaat — then he has (the reward as if he had) spend the entire night standing (in prayer).\"": "2025-11-04T07:53:32.238183",
  "Forgiveness from major sin\nBe sincere — feel remorse\nPromise not to again\nAsk for forgiveness\nGeneral repentance will work\nQuran:\n“If you avoid the major sins which you are forbidden.\nWe will remove from your lesser sins and admit you to a noble entrance into paradise”": "2025-11-04T07:53:32.238183",
  "“He who took a bath and then came for Jumu'a prayer and then prayed what was fixed for him, then kept silence till the Imam finished the sermon, and then prayed along with him, his sins between that time and the next Friday would be forgiven, and even of three days more.”": "2025-11-04T07:53:32.238183",
  "Bismillah before food\nIF not — no barkat in food, shaytan eats with\nMore ppl can have it\nIF forget: during or end par say\nBismillah wa awwalahu wakhirahu(Bismillah all starts and ends with Allah)\nSo then shaytan throws up food": "2025-11-04T07:53:32.238183",
  "People aren't bad. Shaytan is.\nShaytan is always the enemy and need to blame him.": "2025-11-04T07:53:32.238183",
  "Allah says\n“If you avoid the major sins which you are forbidden.\nWe will remove from your lesser sins and admit you to a noble entrance into paradise”\nMajor Sins:\n51 - Breaking fast intentionally in Ramadan – Without a valid excuse, it’s a great sin.\n52 - Harming neighbors – Mistreating neighbors is condemned.\n53 - Using abusive speech – Insulting others is not part of Islamic character.\n54 - Oppressing weak and helpless people – Exploiting the vulnerable is haram.\n55 - Dying without repenting from sins – Delaying repentance leads to regret.\n56 - Arguing excessively and being quarrelsome – Constant disputes lead to sin.\n57 - Neglecting Friday prayers without excuse – Skipping Jummah regularly is sinful.\n58 - Cheating in business – Deception in trade is forbidden.\n59 - Delaying debt repayment without reason – Unjust delays cause injustice.\n60 - Disobeying Allah’s commands intentionally – Rejecting religious obligations is a sin.": "2025-11-04T07:53:32.238183",
  "Subhanallahil Azimi wa bihamdih (x 10)\n4 slaves freed from the line of Ismail A.s": "2025-11-05T02:05:41.016259",
  "Knowing Allah, your Rab is the key to everything(know all names with meanings of Him) - Key to Khushu in namaz\n41 Al-Jaleel         The Majestic\n42 Al-Kareem         The Most Generous, The Most Esteemed\n43 Ar-Raqeeb         The Watchful, The All-Watchful\n44 Al-Mujeeb         The Responsive, The Answerer\n45 Al-Waasi’         The All-Encompassing, the Boundless\n46 Al-Hakeem         The All-Wise\n47 Al-Wadud          The Most Loving\n48 Al-Majeed         The Glorious, The Most Honorable\n49 Al-Baa’ith        The Infuser of New Life\n50 As-Shaheed        The All Observing Witnessing": "2025-11-05T02:05:41.016259",
  "When standing up from ruku\nAllahu Akbaru kabira wal-hamdu Lillahi kathira, wa subhan-Allahi bukratan was asila\n12 angels rush to write this deed": "2025-11-05T02:05:41.016259",
  "2 Sunnah before fajr\nWorth more than this world and everything it contains.": "2025-11-05T02:05:41.016259",
  "SubhanAllahi wa bihamdihi, adada khalqihi, wa rida nafsihi, wa zinatah arshihi, wa midada kalimatihi (x3)\nBetter than hours of dhikr(atleast 3hrs)": "2025-11-05T02:05:41.016259",
  "SubhanAllah al-’Adheemi wa bihamdih\nDate palm tree planted in jannah": "2025-11-05T02:05:41.016259",
  "Jangli gud dhikr\nAlhumdulillahi Rabil alameen\nHadith — My Rab said He likes to be called upon with this": "2025-11-05T02:05:41.016259",
  "Allah says\n“If you avoid the major sins which you are forbidden.\nWe will remove from your lesser sins and admit you to a noble entrance into paradise”\nMajor Sins:\n1 - Associating partners with Allah (Shirk) – The gravest sin; Allah does not forgive it if one dies upon it.\n2 - Committing murder – Unjustly killing a soul is a severe crime in Islam.\n3 - Practicing black magic – Engaging in magic harms faith and leads to disbelief.\n4 - Not performing prayers – Neglecting Salah leads to severe consequences.\n5 - Withholding Zakat – Not paying obligatory charity is a grave offense.\n6 - Not fasting in Ramadan without excuse – Intentionally skipping fasting is a major sin.\n7 - Not performing Hajj when able – Deliberately neglecting Hajj is sinful.\n8 - Disobeying and disrespecting parents – Islam mandates obedience and respect for parents.\n9 - Cutting off family ties – Severing kinship ties invites Allah’s curse.\n10 - Committing adultery or fornication – Engaging in unlawful relations is a great immorality.": "2025-11-05T02:05:41.016259",
  "SubhanAllahi wa bihamdihi, Subhan-Allahil Azeem\nLight on tongue, heavy on scale on Day of Judgement. Loved by Allah.": "2025-11-05T02:05:41.016259",
  "Send salawat on Prophet PBUH!\nClosest ppl to him SAW will be those who sent most salawat on him": "2025-11-05T02:05:41.016259",
  "last_sent_type": "knowing_allah"
}