{
  "If I consume haram\nThat limits the Quran entering into my heart": "2025-11-04T07:40:51.245872",
  "Priority is everything\nAllah is number ONE\nEverything below that — no matter how good it feels, how bad I want it.": "2025-11-04T07:40:51.245872",
  "Being tested is an honour\nAllah only tests the ones He loves": "2025-11-04T07:40:51.245872",
  "SAW: — say when new place come to\nWhen anyone lands at a place\nand says:\n“I seek refuge in the Perfect Word of Allah from the evil of what He has created.\"\n/\nA‘ūdhu bikalimātillāhi-t-tāmmāti min sharri mā khalaq\nNothing would harm him until he marches from that stopping place": "2025-11-04T07:40:51.245872",
  "Life isn’t designed to be comfortable, happy and easy.\nBy the creator’s design — it is uncomfortable, sad and full of struggles.": "2025-11-04T07:40:51.245872",
  "Knowing Allah, your Rab is the key to everything(know all names with meanings of Him) - Key to Khushu in namaz\n21 Al-Baasit         The Extender\n22 Al-Khaafidh       The Reducer, The Abaser\n23 Ar-Raafi’         The Exalter, The Elevator\n24 Al-Mu’izz         The Honourer, The Bestower\n25 Al-Muzil          The Dishonourer, The Humiliator\n26 As-Samee’         The All-Hearing\n27 Al-Baseer         The All-Seeing\n28 Al-Hakam          The Judge, The Giver of Justice\n29 Al-‘Adl           The Utterly Just\n30 Al-Lateef         The Subtle One, The Most Gentle": "2025-11-04T07:40:51.245872",
  "Reach a point where I only worry about my Rab and my deen.": "2025-11-04T07:40:51.245872",
  "SAW:\nWhoever prays Fajr in congregation,\nthen sits remembering Allah until the sun rises,\nthen prays two rak‘ahs,\nWill have a reward like that of Hajj and Umrah.\nComplete, complete, complete.": "2025-11-04T07:40:51.245872",
  "Hippie arab:\nThere are needs and wants\nMost of what we live are wants\nPrayer is what our soul need\nThat peace from the deen is what I personally need": "2025-11-04T07:40:51.245872",
  "Jihad un nafs — struggling with myself(my conscience) for the sake of Allah": "2025-11-04T07:40:51.245872",
  "Imam Shafi:\nMy heart is at ease knowing:\nWhat was meant for me will never miss me\nAnd that which misses me — was never meant for me": "2025-11-04T07:45:34.232435",
  "To get anger to leave\nAudhu billahi min ash-shaytan ir rajim\nI seek refuge in Allah from Shaytan, the rejected/cursed": "2025-11-04T07:45:34.232435",
  "SAW:\nWhen he made some profit in his business\nHe’d invest it back into bidness straight away": "2025-11-04T07:45:34.232435",
  "Be silent when angry.\nRandom quote but based on Hadith": "2025-11-04T07:45:34.232435",
  "SAW:\n\"The one who looks after a widow and a poor person\nis like the Mujahid in the cause of Allah,\nor\nlike the one who fasts all the day and stands (in prayer) all the night.”": "2025-11-04T07:45:34.232435",
  "SAW:\nZina and chori if in neighbourhood weighs 10x more than when with aam log.": "2025-11-04T07:45:34.232435",
  "Deeds most loved by Allah — those that are continuous, even if they are few.\nconsistency >>> quantity": "2025-11-04T07:45:34.232435",
  "SAW:\n\"I and the one who looks after an orphan will be like this in Paradise,\"\nshowing his middle and index fingers and separating them.": "2025-11-04T07:45:34.232435",
  "Knowing Allah, your Rab is the key to everything(know all names with meanings of Him) - Key to Khushu in namaz\n91 Ad-Dhaarr         The Distresser\n92 An-Naafi’         The Propitious, The Benefactor\n93 An-Noor           The Light\n94 Al-Haadi          The Guide\n95 Al-Badee’         The Incomparable Originator\n96 Al-Baaqi          The Ever-Lasting\n97 Al-Waarith        The Inheritor\n98 Ar-Rasheed        The Guide to the Right Path\n99 Al-Saboor         The Patient": "2025-11-04T07:45:34.232435",
  "Allah says\n“If you avoid the major sins which you are forbidden.\nWe will remove from your lesser sins and admit you to a noble entrance into paradise”\nMajor Sins:\n11 - Committing sodomy – Homosexual acts are forbidden in Islam.\n12 - Taking or paying interest (Riba) – Usury is strictly prohibited and leads to destruction.\n13 - Devouring orphan’s wealth – Wrongfully consuming orphan’s wealth is like eating fire.\n14 - Lying about Allah and His Messenger – Fabricating lies about religion leads to punishment.\n15 - Fleeing from the battlefield – Running away from battle without valid reason is sinful.\n16 - Being an unjust ruler – Oppression by leaders results in severe consequences.\n17 - Pride and arrogance – Arrogance leads to downfall and rejection from Paradise.\n18 - Ungratefulness – Not recognizing Allah’s blessings is condemned.\n19 - Intoxicants (alcohol and drugs) – Consuming intoxicants is the work of Satan.\n20 - Gambling – Wasting wealth through betting is a sinful act.": "2025-11-04T07:45:34.232435",
  "last_sent_type": "knowing_allah"
}